Revit 2024 API
MEPBuildingConstructionSet.Insert Method
Insert the specified MEPBuildingConstruction into the set.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual bool Insert(
	MEPBuildingConstruction item
)
Visual Basic
Public Overridable Function Insert ( _
	item As MEPBuildingConstruction _
) As Boolean
Visual C++
public:
virtual bool Insert(
	MEPBuildingConstruction^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction
The MEPBuildingConstruction to be inserted into the set.
Return Value
Returns whether the MEPBuildingConstruction was inserted into the set.
See Also
MEPBuildingConstructionSet Class
Autodesk.Revit.DB.Mechanical Namespace